In [17]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [28]:
df = pd.read_csv("data/dataset.csv")

In [29]:
df

,title,rating,score,vote,type,director,writter,duration,release date,release country,...,reviews,storyline,budget en $,Opening weekend USA en $,gross en $,Cumulate Worldwide Gross en $,runtime,sound Mix,Color,Aspect Ratio
0,Hababam Sinifi,9.3,xxx,38.145,Comedy; Drama,Ertem Egilmez,Umur Bugay,1h 27min,1975-04-01,Turkey,...,65,"Lazy, uneducated students share a very close b...",xxx,xxx,xxx,xxx,87 min,xxx,xxx,xxx
1,Les Évadés,9.3,80,2.392.668,Drama,Frank Darabont,Stephen King,2h 22min,1995-03-1,USA,...,9074,Chronicles the experiences of a formerly succe...,25000000.0,72732,28699976,28817291,142 min,Dolby Digital,Color,1.85 : 1
2,Aynabaji,9.2,xxx,23.791,Crime; Mystery;,Amitabh Reza Chowdhury,Syed Gaosul Alam Shaon,2h 27min,2016-11-17,Bangladesh,...,173,Ayna is an actor and the prison is his stage. ...,412946.33,xxx,xxx,xxx,147 min,xxx,xxx,xxx
3,Le parrain,9.2,100,1.657.565,Crime; Drama,Francis Ford Coppola,Mario Puzo,2h 55min,1972-10-18,USA,...,4406,"The Godfather ""Don"" Vito Corleone is the head ...",6000000.0,30239,134966411,246120986,175 min,DTS\r\n(re-release)| Mono,Color\r\n(Technicolor),1.85 : 1

In [30]:
## 1. Distribution des films par catégorie

In [31]:
data = df.set_index('type')
data.groupby('type')['title'].apply(lambda x: x)

type
Comedy; Drama      Hababam Sinifi
Drama                  Les Évadés
Crime; Mystery;          Aynabaji
Crime; Drama           Le parrain
Name: title, dtype: object

In [32]:
## 2. Top 50 des budgets des films
df[['budget en $', 'title']].sort_values('budget en $').head(3)

  budget en $       title
1  25000000.0  Les Évadés
2   412946.33    Aynabaji
3   6000000.0  Le parrain

In [33]:
## 3. Nombre de films sortie par décennie

In [34]:
df['release date'] = pd.to_datetime(df['release date'])
data = df.set_index('release date')
data.groupby((data.index.year//10)*10).sum()

              rating  reviews
release date
1970            18.5     4471
1990             9.3     9074
2010             9.2      173

In [35]:
## 4 Top 20 films ayant générés le plus de revenu, le moins de revenu.

In [36]:
## 4.1. Top 20 films ayant générés le plus de revenu.

In [37]:
df[['title', 'Cumulate Worldwide Gross en $']].sort_values('Cumulate Worldwide Gross en $').head(10)

            title Cumulate Worldwide Gross en $
3      Le parrain                     246120986
1      Les Évadés                      28817291
0  Hababam Sinifi                           xxx
2        Aynabaji                           xxx

In [38]:
## 4.2. Top 20 films ayant générés le moins de revenu.

In [39]:
df[['title', 'Cumulate Worldwide Gross en $']].sort_values('Cumulate Worldwide Gross en $').tail(10)

            title Cumulate Worldwide Gross en $
3      Le parrain                     246120986
1      Les Évadés                      28817291
0  Hababam Sinifi                           xxx
2        Aynabaji                           xxx

In [40]:
## 5. Analyse de la popularité des films en fonction de leurs budgets

In [42]:
data = df.set_index('budget en $')
data.groupby(by='vote', axis=0, sort=True)[['title', 'vote']].apply(lambda x: x).sort_values('vote')

                      title       vote
budget en $
6000000.0        Le parrain  1.657.565
25000000.0       Les Évadés  2.392.668
412946.33          Aynabaji     23.791
xxx          Hababam Sinifi     38.145

In [ ]:
## 6. Distribution des revenus générés par genre de film

In [44]:
data = df.set_index('type')
data.groupby(by='type')[['title', 'gross en $']].apply(lambda x: x).head(3).sort_values('gross en $')

                          title gross en $
type
Drama                Les Évadés   28699976
Comedy; Drama    Hababam Sinifi        xxx
Crime; Mystery;        Aynabaji        xxx

In [ ]:
## 7. Top 10 des films par retour sur investissement

In [49]:
df.groupby(by='gross en $', axis=0, sort=True)[['title', 'gross en $']].apply(lambda x: x).head(3)

            title  gross en $
0  Hababam Sinifi  28699976.0
1      Les Évadés  28699976.0
2        Aynabaji  28699976.0

In [45]:
## 8. Note moyenne par année de sortie de film

In [46]:
data = df.set_index('release date')
data.groupby(by=data.index.year, axis=0, sort=True)[['title', 'gross en $']].sum()

                       title gross en $
release date
1972              Le parrain  134966411
1975          Hababam Sinifi        xxx
1995              Les Évadés   28699976
2016                Aynabaji        xxx